Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྩྭ་དང་། ཤིང་དང་། ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་དང་། ཆུང་ངུ་ན་སོར་བཞིའི་ཚད་ཙམ་ཡན་ཆད་ཇི་སྙེད་ཡོད་པ་སྐྱེས་བུ་ལ་ལ་ཞིག་གིས་དེ་དག་གཅིག་ཏུ་སྤུངས་ཏེ གཅིག་ཏུ་སྤུངས་ནས་མེས་བསྲེགས་ཏེ་ཚིག་པར་གྱུར་ནས་ཐལ་བར་བྱས་སོ། ། ཐལ་བར་བྱས་ནས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་གང་ན་ཡོད་པ་དེ་དག་ཏུ་བླུགས་ཏེ། ལོ་སྟོང་དུ་དཀྲུགས་ཀྱང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འདི་ལྟ་བུ་ཡོད་དེ། དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་དེ་དང་ལྡན་པས་རྒྱ་མཚོ་ཆེན་པོ་དེ་དང་དེ་དག་ནས་ཐལ་བ་དེ་དག་བླངས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དང་དེ་དག་ཏུ་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་གི་ཤིང་འདི་འདྲ་བ་ཞིག་གི་ཐལ་བའོ། ། འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་གི་ཤིང་ཆེ་གེ་མོ་ཞིག་གི་རྩ་བ་དང་། ཆེ་གེ་མོ་ཞིག་གི་སྡོང་པོ་དང་། ཆེ་གེ་མོ་ཞིག་གི་ཡལ་ག་དང་། ཆེ་གེ་མོ་ཞིག་གི་ལོ་མ་དང་། ཆེ་གེ་མོ་ཞིག་གི་འབྲས་བུའི་ཐལ་བའོ། ། འདི་ནི་ཕྱོགས་ཆེ་གེ་མོ་ཞིག་གི་འདབ་མ་འདི་འདྲ་བ་ཞིག་གི་ཐལ་བའོ། ། ཞེས་རབ་ཏུ་འབྱེད་དོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་རྟོགས་ཏེ། དེ་རབ་ཏུ་རྟོགས་ནས། དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་འདི་ནི་འཇིག་རྟེན་གྱི་ཁམས་ཆེ་གེ་མོ་ཞིག་གི་ཐལ་བའོ། ། ཞེས་རབ་ཏུ་མཁྱེན་པ་ནས་རྒྱས་པར་བྱས་ཏེ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་དེ་ལྟར་རྫུ་འཕྲུལ་ཆེའོ། ། དེ་ལྟར་མཐུ་ཆེའོ། ། འདི་ལྟར་དབང་ཆེ་བར་གྲགས་པ་སྟེ།
en: “Śāriputra, what is it about the tathāgatas’ inconceivable tathāgata knowledge that leads the bodhisatva to have faith in it? What is it that leads the bodhisatva to trust and have confidence in it and not to doubt? What is it that when they learn about it greatly delights and inspires them and makes them consider it to be truly wondrous and extraordinary? Śāriputra, the Tathāgata engages with all phenomena through the unimpeded vision of his knowledge, and it is this that leads the bodhisatva to have great faith, trust, and confidence in it, and so on, and to consider it to be truly wondrous and extraordinary. “I will give you an example of the Tathāgata’s perfect knowledge. Imagine, Śāriputra, the grass, wood, branches, leaves, and petals in as many worlds as there are grains of sand in the river Ganges, down to the very last four-inch piece. Imagine then that someone gathers all this together and then sets fire to it and burns it to ashes. The ashes are then scattered over the oceans in as many worlds as there are grains of sand in the river Ganges, and they are left there for a thousand years to be churned by the waves. Now, Śāriputra, the Tathāgata’s tathāgata knowledge is such that the Tathāgata, possessing this knowledge, would be able take some ash from any of these oceans and identify the world it came from. He would be able to say which world and which region the ash was from, as well as the particular tree, root, trunk, branch, leaf, flower, or petal that it came from. How is he able to do this? The Tathāgata is able to do this, Śāriputra, because he has completely penetrated the totality of phenomena, and with this understanding he is able to discern things, such as which particular world some ash belongs to, in great detail. Thus the tathāgata, arhat, fully accomplished Buddha possesses great magical abilities and has great authority. He is a great lord.

source: ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འདི་ལ་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་ཅིང་དེ་བཞིན་གཤེགས་པ་བྱམས་པས་ཡིད་ལ་བྱེད་པ་དེ་དག་ཐམས་ཅད་ནི་དགེ་བའི་རྩ་བ་འདིའི་མཐའ་མ་ཐོབ་པར་སྡུག་བསྔལ་མཐར་འབྱིན་ཏོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྟོགས་ཏེ། དེ་ཤིན་ཏུ་རྟོགས་པས་དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་ཆུད་མི་ཟའོ། །
en: “Śāriputra, sons and daughters of good family who have faith, trust, and confidence in the Tathāgata, given his tathāgata knowledge, and are captivated by his love will all reach the end of suffering, even if they have not developed the necessary roots of virtue. Why is this? Śāriputra, it is because the Tathāgata has completely penetrated the totality of phenomena. Because he has penetrated it, not a single thought escapes the tathāgatas.

source: ཤཱ་རིའི་བུ་ཁྱོད་ལ་དཔེར་བྱ་སྟེ། འདི་ལ་སྐྱེས་བུ་མཁས་པ་ཁ་ཅིག་དཔེས་བཤད་པའི་དོན་རྣམས་ཀུན་ཤེས་ཏེ། འདི་ལྟ་སྟེ། དཔེར་ན་ཤཱ་རིའི་བུ་སྐྱེས་བུ་ལ་ལ་ཚེ་ལོ་བརྒྱ་པ་ལོ་བརྒྱར་འཚོ་བ་ཞིག་གིས་སྐྲའི་རྩེ་མོ་བྱེ་བ་བརྒྱར་བཙལ་བས་ཆུའི་ཐིགས་པ་བླངས་ཏེ། ང་གང་ན་བ་དེར་འོངས་ནས་ ཕྱིན་པ་དང་། འདི་སྐད་ཅེས་ཀྱེ་གཽ་ཏ་མ་བདག་གིས་ཆུའི་ཐིགས་པ་འདི་ཁྱོད་ལ་གདམས་ཀྱིས་ནམས་བདག་ལ་དགོས་པར་གྱུར་པ་དེ་ན་སླར་བྱིན་ཅིག་ཅེས་ཟེར་བ་དང་། དེ་བཞིན་གཤེགས་པས་དེ་བླངས་ཏེ་ རྒྱ་མཚོ་ཆེན་པོར་བོར་ནས་ དེ་ཆུའི་རྒྱུན་གྱིས་བདས་ཏེ་འདྲེས་ནས་ ལྷན་ཅིག་ཏུ་མཐར་གྱིས་རྒྱ་མཚོ་ཆེན་པོར་ཞུགས་སོ། ། དེ་ནས་སྐྱེས་བུ་ཚེ་ལོ་བརྒྱ་པ་དེ་ལོ་བརྒྱ་ལོན་པ་དང་ང་ག་ལ་བ་དེར་འོངས་ཏེ། ཕྱིན་ནས་འདི་སྐད་ཅེས་གཽ་ཏ་མ་བདག་གི་ཆུའི་ཐིགས་པ་དེ་དགོས་ཀྱིས་བདག་ལ་བྱིན་ཅིག་ཅེས་ཟེར་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཡོད་དེ། ཡེ་ཤེས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་སྐྲའི་རྩེ་མོ་བྱེ་བ་བརྒྱར་བཙལ་བས་ཆུའི་ཐིགས་པ་དེ་རྒྱ་མཚོ་ཆེན་པོ་དེ་ནས་ཆུ་གཞན་དང་མ་འདྲེས་པར་བླངས་ཏེ སྐྱེས་བུ་དེ་ལ་སླར་བྱིན་ནོ། ། ཤཱ་རིའི་བུ་འདི་ལྟར་དོན་ཤེས་པར་བྱ་བའི་ཕྱིར་ཁྱོད་ལ་དཔེར་བསྟན་ཏེ། དེ་གང་གི་དོན་དུ་བལྟ་ཞེ་ན། འདི་ལྟ་སྟེ། ཤཱ་རིའི་བུ་སྐྱེས་བུའི་ཆུའི་ཐིགས་པ་དེ་བཞིན་གཤེགས་པའི་ལག་ཏུ་བཞག་པ་ཡུན་རིང་མོ་ཞིག་ལོན་ཡང་ཆུད་མི་ཟ་བ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འདི་ལྟ་བུ་ལ་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་ཅིང་དེ་བཞིན་གཤེགས་པ་བྱམས་པས་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཉིད་ལ་དམིགས་ནས་ དེའི་ཕྱིར་ནམ་མཁའ་ལ་མེ་ཏོག་འཐོར་བ་དེ་དག་ཐམས་ཅད་དགེ་བའི་རྩ་བ་འདིའི་མཐའ་མ་ཐོབ་པར་སྡུག་བསྔལ་མཐར་འབྱིན་པར་འགྱུར་རོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར།
en: “I will give you another example Śāriputra, as intelligent people understand what we say even when only a single example is given. Śāriputra, imagine someone with a hundred years to live who had a drop of water as small as the tip of a hair split into one hundred parts. He would come to the place where I was staying, and say, ‘Excuse me, Gautama. I would like to leave this drop of water with you, and then I would like you to give it back when I need it.’ The Tathāgata would take it and throw it into the river Ganges, where it would be carried away by the current and eventually reach the ocean. Now, that person who had a hundred years to live would eventually reach the age of one hundred and come back to see me. He would say, ‘Gautama, I need the drop of water now, please give it back to me.’ Now, Śāriputra, the Tathāgata’s tathāgata knowledge is such that the tathāgata, the arhat, the fully accomplished Buddha, possessing this knowledge, could retrieve the drop of water as small as the tip of a hair split into one hundred parts from the great ocean and give it back to that person, unmixed with any other liquid. Śāriputra, I give you this example in order that you may understand a particular point. The point, Śāriputra, is that that person’s drop of water would not be lost once it had been received by the Tathāgata, even after a long time. “Sons and daughters of good family who have faith and confidence in the knowledge of the Tathāgata, being of this kind, understanding that it is as I have described it, who make a mental effort concerning the Tathāgata out of love for him and scatter flowers in the air when they encounter the Tathāgata himself, will all reach the end of suffering, even if they have not developed the necessary roots of virtue. Why is this? Śāriputra, it is because the Tathāgata has completely penetrated the totality of phenomena. Because he has penetrated it, not a single thought escapes the tathāgatas.”

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་རྟོགས་ཏེ། དེ་རབ་ཏུ་རྟོགས་པས་དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་སེམས་གཅིག་བསྐྱེད་པ་ཡང་ཆུད་མི་ཟའོ། ། དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The venerable Śāriputra then asked the Lord, “Lord, is consciousness involved in the tathāgatas’ tathāgata knowledge, or not?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གང་རྣམ་པར་ཤེས་པ་མ་མཆིས་པར་འཇུག་པ་མཆིས་སམ་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་དེ་ནི་མ་ཡིན་ནོ། །
en: “It is not, Śāriputra.”

source: བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ནི་གང་ལགས། རྣམ་པར་ཤེས་པ་ནི་གང་ལགས།
en: “Lord, what is knowledge and what is consciousness?”

source: ཤཱ་རིའི་བུ་འདི་བཞི་ནི་རྣམ་པར་ཤེས་པའི་གནས་ཏེ་རྣམ་པར་ཤེས་པ་དེ་ལ་གནས་སོ། ། འདི་ལྟ་སྟེ་རྣམ་པར་ཤེས་པའི་གཟུགས་ལ་ཉེ་བར་སོང་ཞིང་གནས། གཟུགས་ལ་དམིགས། གཟུགས་ལ་གནས། དགའ་བ་ལ་བསྟེན་པས་སྐྱེ་ཞིང་འཕེལ་ཏེ་རྒྱས་པར་འགྱུར་བ་དང་། རྣམ་པར་ཤེས་པ་ཚོར་བ་ལ་ཉེ་བར་སོང་ཞིང་གནས། ཚོར་བ་ལ་དམིགས། ཚོར་བ་ལ་གནས། དགའ་བ་ལ་བསྟེན་པས་སྐྱེ་ཞིང་འཕེལ་ཏེ་རྒྱས་པར་འགྱུར་བ་དང་། རྣམ་པར་ཤེས་པ་འདུ་ཤེས་ལ་ཉེ་བར་སོང་ཞིང་གནས། འདུ་ཤེས་ལ་དམིགས། འདུ་ཤེས་ལ་གནས། དགའ་བ་ལ་བསྟེན་པས་སྐྱེ་ཞིང་འཕེལ་ཏེ་རྒྱས་པར་འགྱུར་བ་དང་། རྣམ་པར་ཤེས་པ་འདུ་བྱེད་ལ་ཉེ་བར་སོང་ཞིང་གནས། འདུ་བྱེད་ལ་དམིགས། འདུ་བྱེད་ལ་གནས། དགའ་བ་ལ་བསྟེན་པས་སྐྱེ་ཞིང་འཕེལ་ནས་རྒྱས་པར་འགྱུར་བ་སྟེ།
en: “Consciousness has four supports that it rests on, Śāriputra. Consciousness rests on its relationship to form. It is dependent on form and rooted in form. It pursues pleasure, and then it grows, thrives, and expands. Consciousness rests on its relationship to feeling. It is dependent on feeling, rooted in feeling. It pursues pleasure, and then it grows, thrives, and expands. Consciousness rests on its relationship to perception. It is dependent on perception and rooted in perception. It pursues pleasure, and then it grows, thrives, and expands. Consciousness rests on its relationship to mental conditioning. It is dependent on mental conditioning and rooted in mental conditioning. It pursues pleasure, and then it grows, thrives, and expands. This is what is meant by consciousness, Śāriputra. When the skandha of consciousness is no longer governed by the five skandhas of grasping, true knowledge arises, and this is what is meant by knowledge.

source: ཤཱ་རིའི་བུ་འདི་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ལེན་པའི་ཕུང་པོ་ལྔ་ལ་མི་གནས་པར་རྣམ་པར་ཤེས་པའི་ཕུང་པོ་ཡོངས་སུ་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། ། གཞན་ཡང་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་སའི་ཁམས་རྣམ་པར་ཤེས་པ་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་རྣམ་པར་ཤེས་པ་སྟེ། འདི་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ཁམས་བཞི་ལ་མི་གནས་པར་རྣམ་པར་ཤེས་པའི་ཆོས་ཀྱི་ཁམས་ཀུན་ཏུ་དབྱེ་བ་ཤེས་པ་འདི་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Moreover, consciousness discerns the earth element, and it discerns the water element, the fire element, the wind element, and the space element. This is what is meant by consciousness. When consciousness is no longer governed by the four elements, there arises knowledge that can analyze the totality of phenomena. This is what is meant by knowledge.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་གང་མིག་གི་ཤེས་པར་བྱ་བའི་གཟུགས་རྣམ་པར་རིག་པ་དང་། རྣ་བས་ཤེས་པར་བྱ་བའི་སྒྲ་རྣམ་པར་རིག་པ་དང་། སྣས་ཤེས་པར་བྱ་བའི་དྲི་རྣམ་པར་རིག་པ་དང་། ལྕེས་ཤེས་པར་བྱ་བའི་རོ་རྣམ་པར་རིག་པ་དང་། ལུས་ཀྱིས་ཤེས་པར་བྱ་བའི་རེག་བྱ་རྣམ་པར་རིག་པ་དང་། ཡིད་ཀྱིས་ཤེས་པར་བྱ་བའི་ཆོས་རྣམ་པར་རིག་པ་སྟེ། འདི་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་ནང་ཉེ་བར་ཞི་ཞིང་ཕྱི་རོལ་དུ་མི་རྒྱུ་སྟེ་ཡེ་ཤེས་ཀྱི་ཕྱིར་འབྲང་ཞིང་ཆོས་གང་ལ་ཡང་མི་རྟོག་རྣམ་པར་མི་རྟོག་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Moreover, Śāriputra, consciousness refers to the conceptualization of forms being the mental object of the eye, the conceptualization of sounds being the mental object of the ears, the conceptualization of smells being the mental object of the nose, the conceptualization of tastes being the mental object of the tongue, the conceptualization of physical objects being the mental object of the body, and the conceptualization of mental states being the mental object of the mind. This is what is meant by consciousness. Now, when one possesses inner tranquility, when one’s attention is not swayed by external circumstances, when one does not mentally construct or conceptualize any phenomenon, this is what is meant by knowledge.

source: རྣམ་པར་ཤེས་པ་ནི་དམིགས་པ་ལས་སྐྱེའོ། ། རྣམ་པར་ཤེས་པ་ནི་ཡིད་ལ་བྱེད་པ་ལས་སྐྱེའོ། ། རྣམ་པར་ཤེས་པ་ནི་ཡོངས་སུ་རྟོག་པ་ལས་སྐྱེ་སྟེ་དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། གང་འཛིན་པ་མེད་པས་སྙེམས་པ་དང་དམིགས་པ་མེད་རྣམ་པར་རིག་པ་མེད་ཅིང་མི་རྟོག་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Consciousness arises from apprehending an object. Consciousness arises from mental activity. Consciousness arises from assumptions. This is what is meant by consciousness. However, contact without any intention of grasping, with no object, and with no concepts or mental constructions is what is called knowledge.

source: གཞན་ཡང་འདུས་བྱས་ལ་སྤྱོད་པའི་ཆོས་ལ་རྣམ་པར་ཤེས་པ་ལ་གནས་ཤིང་གང་འདུས་བྱས་ལ་སྤྱོད་པའི་ཆོས་རྣམ་པར་ཤེས་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ། ། འདུས་མ་བྱས་ལ་ནི་རྣམ་པར་ཤེས་པ་རྒྱུ་བ་མེད་དེ། གང་འདུས་མ་བྱས་ཤེས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Moreover, consciousness dwells within the domain of conditioned phenomena, and that consciousness that dwells within the domain of conditioned phenomena is what is meant by consciousness. On the other hand, there is no conscious activity in relation to the unconditioned. Unconditioned consciousness, therefore, is what is meant by knowledge.

source: གཞན་ཡང་གང་སྐྱེ་བ་དང་། འཇིག་པ་ལ་རབ་ཏུ་གནས་པ་དེ་ནི་རྣམ་པར་ཤེས་པའོ། ། གང་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་ལ་གནས་པ་དེ་ནི་ཡེ་ཤེས་ཞེས་བྱའོ། །
en: “Moreover, consciousness is what is based upon creation and destruction, whereas knowledge is not based upon creation and destruction.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་འདི་ནི་རྣམ་པར་ཤེས་པ། འདི་ནི་ཡེ་ཤེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ནས་ངོ་མཚར་དང་། རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “This, Śāriputra, is the difference between consciousness and knowledge, and this is why the bodhisatva has great faith in it. He has trust and confidence and does not doubt it, and to an even greater degree he feels pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་བསྟན་པའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this point further, the Lord went on to speak these verses:

source: ཇི་ལྟར་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དཔག་མེད་པ། །དེ་བཞིན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་ཀྱི་རྩྭ་རྣམས་ནི། །དེ་དག་སྐྱེས་བུ་ལ་ལས་མེར་བསྲེགས་ཐལ་བར་བྱས། །ལོ་ནི་བ རྒྱ་སྟོང་དག་ཏུ་རྒྱ་མཚོར་དཀྲུགས་པ་རྣམས། །དེ་འདྲ་བ་ཡི་སྟོབས་བཅུ་ཡེ་ཤེས་ཕྲ་མངའ་བས། །ཐལ་བ་བླངས་ནས་འགྲོ་བ་དག་ལ་ལུང་སྟོན་པ། །ཞིང་རྣམས་རབ་འབྱམ་དག་གི་ཤིང་རིགས་འདི། །དེ་ཚིག་ཐལ་བ་འདི་ཞེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན། །
en: “If someone takes an immeasurable amount of grass from the worlds in the ten directions, As much as there are grains of sand in the river Ganges, He may let it burn to ashes And be scattered in the ocean for a hundred thousand years. “The knowledge of the one with ten powers is so precise That he can retrieve the ashes and declare to the world The specific location and plant from which these burnt ashes came. The Omniscient One knows this.

source: འདི་ལྟར་ཕྱོགས་བཅུ་དག་གི་འཇིག་རྟེན་ཁམས་ཀྱི་རྡུལ། །ཐམས་ཅད་རྡུལ་དུ་བྱས་ནས་རྒྱལ་བ་རྣམས་སྟོན་ཏེ། །
en: “Likewise, the Victorious One can perceive All the atoms in the worlds in the ten directions.

source: དེ་དག་ཐམས་ཅད་འགྲང་ཡང་ཆགས་མེད་ཐེ་ཚོམ་མེད། །
en: He can count these particles with no doubt or difficulty.

source: དེ་ལྟར་བདེ་བར་གཤེགས་ཀྱི་ཡེ་ཤེས་ནམ་མཁའ་བཞིན། །ཇི་སྙེད་ཕྱོགས་བཅུའི་འགྲོ་བ་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུད། །གང་དག་འདོད་ཆགས་སྤྱོད་དང་ཞེ་སྡང་གཏི་མུག་ལྡན། །
en: Such is the sky-like knowledge of the sugatas. “However many sentient beings there are in the ten directions, Driven by passion and bogged down by bewilderment,

source: སྤྱོད་པ་ཀུན་གྱི་ཚུལ་ཤེས་བསམ་པ་རྣམས་དང་ནི། །གང་གིས་བློ་ཉམས་གང་གིས་ཐར་བར་འགྱུར་བ་མཁྱེན། །
en: The one who is skilled in the workings of the world knows their condition. He knows whose mind is degenerate and who will reach liberation. “The knowledge of those of ten powers, supreme in the world, Can penetrate the entire totality of phenomena in all ten directions.

source: འཇིག་རྟེན་ཀུན་མཆོག་སྟོབས་བཅུ་རྣམས་ཀྱི་ཡེ་ཤེས་ནི། །ཇི་སྙེད་ཕྱོགས་བཅུའི་ཆོས་ཀྱི་དབྱིངས་སུ་རབ་ཞུགས་ཀྱང་། །འདྲེན་པ་རྣམས་ལ་རྟོག་དང་རྣམ་པར་རྟོག་མི་འབྱུང་། །བདེ་གཤེགས་སྲས་པོ་དད་པ་རྒྱལ་ལ་དད་པར་བྱེད།། །།༄༅༅། །
en: The guides do not engage in mental constructions or conceptualization, And so the faithful sons and daughters of the sugatas have confidence in the Victorious One.

source: ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་འོད་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ཅིང་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་དབྱིངས་རབ་ཏུ་རྟོགས་ཏེ། དེ་རབ་ཏུ་རྟོགས་པས་དེ་བཞིན་གཤེགས་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་མངོན་པར་གཤེགས་ནས་ལམ་མེ། ལྷན་ནེ། ལྷང་ངེར་མཛད་དོ། ། དེ་འདི་ལྟ་སྟེ་དཔེར་ན་སྤྲིན་མེད་པའི་ནམ་མཁའ་ལ་ཉི་མ་མངོན་པར་ཤར་ནས་ ལམ་མེ་ལྷན་ནེ། ལྷང་ངེ་བ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་མངོན་པར་གཤེགས་ནས་ ལམ་མེ། ལྷན་ནེ། ལྷང་ངེར་མཛད་དོ། །
en: “Śāriputra, what is it about the Tathāgata’s inconceivable tathāgata radiance that leads the bodhisatva to have faith in it? What is it that leads the bodhisatva to trust and have confidence in it and not to doubt? What is it that leads him to an even greater degree to feel pleasure, joy, and satisfaction as he produces the concept of it as being truly wondrous and extraordinary? Śāriputra, the Tathāgata has completely penetrated the totality of phenomena, and when this understanding has arisen, the Tathāgata ascends through the threefold thousand great thousand worlds and shines, glows, and radiates. When the sun appears from behind a receding cover of cloud, it shines, glows, and radiates. In just the same way, Śāriputra, the tathāgata, arhat, the fully accomplished Buddha ascends through the threefold thousand great thousand worlds and shines, glows, and radiates.

source: ཤཱ་རིའི་བུ་སྲིན་བུ་མེ་ཁྱེར་གྱི་འོད་དེ་བས་ནི་གང་འབྲུ་མར་གྱི་མར་མེའི་འོད་འདི་ཤིན་ཏུ་འཕགས། ཤིན་ཏུ་མཆོག །ཤིན་ཏུ་ཁ་དོག་དང་ལྡན། ཤིན་ཏུ་འོད་གསལ། ཤིན་ཏུ་རྒྱ་ཆེའོ། ། འབྲུ་མར་གྱི་མར་མེའི་འོད་དེ་བས་ནི་རྩིག་པ་ཆེན་པོའི་འོད་འདི་ཤིན་ཏུ་འཕགས། ཤིན་ཏུ་མཆོག་པ་ནས་ཤིན་ཏུ་རྒྱ་ཆེ་བའི་བར་དུའོ། །གང་རྩིག་པ་ཆེན་པོའི་འོད་དེ་བས་ནི་མེའི་ཕུང་པོ་ཆེན་པོའི་འོད་གང་ཡིན་པ་དང་། སྨན་དང་སྐར་མའི་འོད་གང་ཡིན་པའི་བར་དུ་རྒྱས་པར་བྱ་སྟེ་ཟླ་བའི་འོད་དང་། ཉི་མའི་འོད་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འོད་དང་། གཞལ་མེད་ཁང་དང་། ལུས་ཀྱི་རྒྱན་རྣམས་དང་། དེ་བཞིན་དུ་སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་དང་། འཐབ་བྲལ་བ་རྣམས་དང་། དགའ་ལྡན་པ་རྣམས་དང་། འཕྲུལ་དགའ་བ་རྣམས་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ར་བ་དང་། གཞལ་མེད་ཁང་དང་། ལུས་ཀྱི་རྒྱན་རྣམས་དང་། གང་ཚངས་པ་རྣམས་དང་། ཚངས་རིས་པ་རྣམས་དང་། ཚངས་པའི་མདུན་ན་འདོན་པ་རྣམས་དང་། ཚངས་འཁོར་བ་རྣམས་དང་། ཚངས་ཆེན་གྱི་ལྷ་རྣམས་ཀྱི་ར་བ་དང་། གཞལ་མེད་ཁང་དང་། ལུས་ཀྱི་རྒྱན་རྣམས་ཀྱི་འོད་འདི་ཤིན་ཏུ་འཕགས། ཤིན་ཏུ་བཟང་། ཤིན་ཏུ་མཆོག །ཤིན་ཏུ་ཁ་དོག་དང་ལྡན། ཤིན་ཏུ་འོད་གསལ། ཤིན་ཏུ་རྒྱ་ཆེའོ། ། གང་ཚངས་པ་རྣམས་དང་། ཚངས་རིས་པ་རྣམས་དང་། ཚངས་པའི་མདུན་ན་འདོན་པ་རྣམས་དང་། ཚངས་འཁོར་བ་རྣམས་དང་། ཚངས་ཆེན་གྱི་ལྷ་རྣམས་ཀྱི་འོད་ཀྱང་རྒྱས་པར་བྱ་སྟེ འོད་ཆེན་དང་། འོད་ཆུང་དང་། ཚད་མེད་འོད་དང་། འོད་གསལ་ནས། དགེ་རྒྱས་ཀྱི་བར་དང་། འབྲས་བུ་ཆེ་དང་། འདུ་ཤེས་ཅན་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། ཤིན་ཏུ་མཐོང་གི་ར་བ་དང་། གཞལ་མེད་ཁང་དང་། ལུས་ཀྱི་འོད་དང་། གང་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ར་བ་དང་། གཞལ་མེད་ཁང་རྣམས་དང་། ལུས་ཀྱི་འོད་འདི་ཤིན་ཏུ་འཕགས། ཤིན་ཏུ་བཟང་། ཤིན་ཏུ་མཆོག །ཤིན་ཏུ་ཁ་དོག་དང་ལྡན་ཤིན་ཏུ་འོད་གསལ། ཤིན་ཏུ་རྒྱ་ཆེའོ། ། གང་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་ར་བ་དང་། གཞལ་མེད་ཁང་རྣམས་དང་། ལུས་ཀྱི་འོད་བས་ནི་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་འོད་འདི་ཤིན་ཏུ་འཕགས། ཤིན་ཏུ་བཟང་། ཤིན་ཏུ་མཆོག །ཤིན་ཏུ་ཁ་དོག་དང་ལྡན་ཤིན་ཏུ་འོད་གསལ། ཤིན་ཏུ་རྒྱ་ཆེའོ། །
en: “Śāriputra, compared to the radiance of a firefly, the radiance of a sesame oil lamp is far greater, stronger, fuller, brighter, and more magnificent. Compared to the radiance of a sesame oil lamp, the radiance of a great bright wall is far greater, stronger, and so forth and more magnificent. Compared to the radiance of a great wall, the radiance of a great mass of fire and the radiance of the Medicine Star are far greater, and so forth. Compared to the radiance of the moon and the radiance of the sun, the radiance of the gods of the Heaven of the Four Great Kings, of their courtyards and palaces, and of their bodies is far greater, more excellent, stronger, fuller, brighter, and more magnificent. Likewise, the radiance of the gods of the Thirty-Three, of Yāma Heaven, of Tuṣita Heaven, of the Heaven of the Joy of Creation, of the Heaven of the Power over Others’ Creations, of their courtyards and palaces, and of their bodies, the radiance of the gods of the brahmā heavens, the Brahmakāyika gods, the Brahmapurohita gods, the Brahmapārṣadya gods, and the great brahmās, of their courtyards and palaces, and of their bodies is far greater, more excellent, stronger, fuller, brighter, and more magnificent than the radiance of the moon and the radiance of the sun. Compared to the radiance of the gods of the brahmā heavens, the Brahmakāyika gods, the Brahmapurohita gods, the Brahmapārṣadya gods, the great brahmās, and so forth, and compared to the radiance of the gods of the Heaven of Radiance, the Heaven of Lesser Light, the Heaven of Immeasurable Light, the Heaven of Brilliance, and so forth, the radiance of the gods of the Heaven of Vast Virtue and so forth, the radiance of the gods of the Heaven of Great Results, the Heaven of Perception, the Heaven of Nonperception, the Heaven of Neither Perception nor Nonperception, the Heaven of Nothing Greater, the Heaven of No Distress, the Heaven of Excellent Appearance, and the Heaven of Exceptional Sight, of their courtyards and palaces, and of their bodies, the radiance of the gods of Nothing Higher, of their courtyards and palaces, and of their bodies is far greater, more excellent, stronger, fuller, brighter, and more magnificent. Compared to the radiance of the gods of Nothing Higher, of their courtyards and palaces, and of their bodies, the radiance of the tathāgata, arhat, fully accomplished Buddha is far greater, more excellent, much stronger, fuller, brighter, and more magnificent.
